import { News } from "../models";

export const newsAboutInjury: News = {
  id: "91446c35-21b5-48c0-9f54-71b48942d674",
  type: "Медицина",
  title: "Рана на ноге - от небольшой царапины до язвы",
  description: "2-го февраля мы предлагали поставить диагноз 13-летней девочке, которая обратилась с порезом на левой ступне, состояние которого ухудшалось. В этом месте была минимально выраженная болезненность, за день до посещения врача у пациентки была субфебрильная температура. При осмотре было обнаружено слабо болезненное язвенное поражение размером 3×3 см на тыльной поверхности левой стопы. Поражение имело приподнятые границы с минимально выраженной окружающей эритемой и уплотнением. Поверх него был струп, но без гнойных выделений. Результаты лабораторных анализов были без патологических отклонений.",
  publishDate: "10.01.2023",
  previewSrc: "https://espanarusa.com/files/autoupload/27/41/7/jai3vqo4376381.jpg",
  createdBy: "Аникеев А.С.",
  updatedBy: "Аникеев А.С.",
  created: "10.01.2023",
  updated: "10.01.2023",
}

export const newsAboutDentistry: News = {
  id: "ab808b12-d0d6-4edc-a535-0f8c96d7aa92",
  type: "Медицина",
  title: "Инновации в стоматологии. За чем будущее?",
  description: "9 февраля во всем мире отмечают День стоматолога. Мы сердечно поздравляем наших врачей, пусть ваша профессиональная деятельность будет яркой, долгой и динамичной. Желаем успехов и новых достижений!\n" +
    "\n" +
    "Сегодня стоматология является одним из самых высокотехнологичных, быстроразвивающихся и перспективных отраслей медицины. Изменения в этой сфере происходят постоянно: появляются новые методики и материалы, совершенствуется оборудование. \n" +
    "\n" +
    "Использование инноваций обеспечивает конкурентное преимущество и большую привлекательность для взыскательных пациентов. \n" +
    "\n" +
    "Наша Компания внимательно следит за новинками и трендами в мире стоматологических услуг. Многие из которых уже внедрены в поликлиниках Сети. ",
  publishDate: "10.01.2023",
  previewSrc: "https://phonoteka.org/uploads/posts/2021-06/1624727121_24-phonoteka_org-p-meditsinskie-oboi-krasivo-29.jpg",
  createdBy: "Аникеев А.С.",
  updatedBy: "Аникеев А.С.",
  created: "10.01.2023",
  updated: "10.01.2023",
}

export const newsAboutOne: News = {
  id: "814661d7-f594-4d1d-acef-c71389fb4d82",
  type: "Медицина",
  title: "Инновации в стоматологии. За чем будущее?",
  description: "9 февраля во всем мире отмечают День стоматолога. Мы сердечно поздравляем наших врачей, пусть ваша профессиональная деятельность будет яркой, долгой и динамичной. Желаем успехов и новых достижений!\n" +
    "\n" +
    "Сегодня стоматология является одним из самых высокотехнологичных, быстроразвивающихся и перспективных отраслей медицины. Изменения в этой сфере происходят постоянно: появляются новые методики и материалы, совершенствуется оборудование. \n" +
    "\n" +
    "Использование инноваций обеспечивает конкурентное преимущество и большую привлекательность для взыскательных пациентов. \n" +
    "\n" +
    "Наша Компания внимательно следит за новинками и трендами в мире стоматологических услуг. Многие из которых уже внедрены в поликлиниках Сети. ",
  publishDate: "10.01.2023",
  previewSrc: "https://phonoteka.org/uploads/posts/2021-06/1624727121_24-phonoteka_org-p-meditsinskie-oboi-krasivo-29.jpg",
  createdBy: "Аникеев А.С.",
  updatedBy: "Аникеев А.С.",
  created: "10.01.2023",
  updated: "10.01.2023",
}

export const newsAboutTwo: News = {
  id: "ed22417d-2e77-45f5-b5fa-5b449bb2768f",
  type: "Медицина",
  title: "Инновации в стоматологии. За чем будущее?",
  description: "9 февраля во всем мире отмечают День стоматолога. Мы сердечно поздравляем наших врачей, пусть ваша профессиональная деятельность будет яркой, долгой и динамичной. Желаем успехов и новых достижений!\n" +
    "\n" +
    "Сегодня стоматология является одним из самых высокотехнологичных, быстроразвивающихся и перспективных отраслей медицины. Изменения в этой сфере происходят постоянно: появляются новые методики и материалы, совершенствуется оборудование. \n" +
    "\n" +
    "Использование инноваций обеспечивает конкурентное преимущество и большую привлекательность для взыскательных пациентов. \n" +
    "\n" +
    "Наша Компания внимательно следит за новинками и трендами в мире стоматологических услуг. Многие из которых уже внедрены в поликлиниках Сети. ",
  publishDate: "10.01.2023",
  previewSrc: "https://phonoteka.org/uploads/posts/2021-06/1624727121_24-phonoteka_org-p-meditsinskie-oboi-krasivo-29.jpg",
  createdBy: "Аникеев А.С.",
  updatedBy: "Аникеев А.С.",
  created: "10.01.2023",
  updated: "10.01.2023",
}

export const newsAboutThree: News = {
  id: "123cc06d-e575-4ed9-ab63-deaef47c1d80",
  type: "Медицина",
  title: "Инновации в стоматологии. За чем будущее?",
  description: "9 февраля во всем мире отмечают День стоматолога. Мы сердечно поздравляем наших врачей, пусть ваша профессиональная деятельность будет яркой, долгой и динамичной. Желаем успехов и новых достижений!\n" +
    "\n" +
    "Сегодня стоматология является одним из самых высокотехнологичных, быстроразвивающихся и перспективных отраслей медицины. Изменения в этой сфере происходят постоянно: появляются новые методики и материалы, совершенствуется оборудование. \n" +
    "\n" +
    "Использование инноваций обеспечивает конкурентное преимущество и большую привлекательность для взыскательных пациентов. \n" +
    "\n" +
    "Наша Компания внимательно следит за новинками и трендами в мире стоматологических услуг. Многие из которых уже внедрены в поликлиниках Сети. ",
  publishDate: "10.01.2023",
  previewSrc: "https://phonoteka.org/uploads/posts/2021-06/1624727121_24-phonoteka_org-p-meditsinskie-oboi-krasivo-29.jpg",
  createdBy: "Аникеев А.С.",
  updatedBy: "Аникеев А.С.",
  created: "10.01.2023",
  updated: "10.01.2023",
}

export const newsAboutFour: News = {
  id: "5c9df3e4-e56c-4134-af7b-d10804c4e5e1",
  type: "Медицина",
  title: "Инновации в стоматологии. За чем будущее?",
  description: "9 февраля во всем мире отмечают День стоматолога. Мы сердечно поздравляем наших врачей, пусть ваша профессиональная деятельность будет яркой, долгой и динамичной. Желаем успехов и новых достижений!\n" +
    "\n" +
    "Сегодня стоматология является одним из самых высокотехнологичных, быстроразвивающихся и перспективных отраслей медицины. Изменения в этой сфере происходят постоянно: появляются новые методики и материалы, совершенствуется оборудование. \n" +
    "\n" +
    "Использование инноваций обеспечивает конкурентное преимущество и большую привлекательность для взыскательных пациентов. \n" +
    "\n" +
    "Наша Компания внимательно следит за новинками и трендами в мире стоматологических услуг. Многие из которых уже внедрены в поликлиниках Сети. ",
  publishDate: "10.01.2023",
  previewSrc: "https://phonoteka.org/uploads/posts/2021-06/1624727121_24-phonoteka_org-p-meditsinskie-oboi-krasivo-29.jpg",
  createdBy: "Аникеев А.С.",
  updatedBy: "Аникеев А.С.",
  created: "10.01.2023",
  updated: "10.01.2023",
}

export const newsAboutFive: News = {
  id: "45ceb3ce-faca-4472-9a8e-c02345bf77f1",
  type: "Медицина",
  title: "Рана на ноге - от небольшой царапины до язвы",
  description: "2-го февраля мы предлагали поставить диагноз 13-летней девочке, которая обратилась с порезом на левой ступне, состояние которого ухудшалось. В этом месте была минимально выраженная болезненность, за день до посещения врача у пациентки была субфебрильная температура. При осмотре было обнаружено слабо болезненное язвенное поражение размером 3×3 см на тыльной поверхности левой стопы. Поражение имело приподнятые границы с минимально выраженной окружающей эритемой и уплотнением. Поверх него был струп, но без гнойных выделений. Результаты лабораторных анализов были без патологических отклонений.",
  publishDate: "10.01.2023",
  previewSrc: "https://espanarusa.com/files/autoupload/27/41/7/jai3vqo4376381.jpg",
  createdBy: "Аникеев А.С.",
  updatedBy: "Аникеев А.С.",
  created: "10.01.2023",
  updated: "10.01.2023",
}

export const newsAboutSix: News = {
  id: "5b687241-513f-4758-9821-e5434c24420c",
  type: "Медицина",
  title: "Рана на ноге - от небольшой царапины до язвы",
  description: "2-го февраля мы предлагали поставить диагноз 13-летней девочке, которая обратилась с порезом на левой ступне, состояние которого ухудшалось. В этом месте была минимально выраженная болезненность, за день до посещения врача у пациентки была субфебрильная температура. При осмотре было обнаружено слабо болезненное язвенное поражение размером 3×3 см на тыльной поверхности левой стопы. Поражение имело приподнятые границы с минимально выраженной окружающей эритемой и уплотнением. Поверх него был струп, но без гнойных выделений. Результаты лабораторных анализов были без патологических отклонений.",
  publishDate: "10.01.2023",
  previewSrc: "https://espanarusa.com/files/autoupload/27/41/7/jai3vqo4376381.jpg",
  createdBy: "Аникеев А.С.",
  updatedBy: "Аникеев А.С.",
  created: "10.01.2023",
  updated: "10.01.2023",
}

export const newsFixturesPage: News[] = [
  newsAboutInjury,
  newsAboutDentistry,
  newsAboutOne,
  newsAboutTwo,
  newsAboutThree,
  newsAboutFour,
  newsAboutFive,
  newsAboutSix,
]

export const getMockById = (id: News["id"]): News => {
  const currentNews = newsFixturesPage.filter((news) => news.id === id);
  return currentNews[0];
}
